public class Main {
	



	public static void main(String[] args) {
		
	}
}


// 1. Реализовать абстрактный класс User и его наследники Student и Teacher. 
// Родитель имеет в себе общие данные (пример: фио, год рождения и тд), 
// а наследники собственные параметры (какие, по выбору преподавателя – Пример:
//  studentId для Student, disciplesTaught для Teacher).
// 2. После этого проговорить со студентами важность снижения дублирования
//  кода и легкость управления структурой данных 
//  (в том числе, создание необходимого числа корректных конструкторов) 
//  и добавления новых сущностей путем наследования от абстрактного класса